app/views/parties/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."party_id" = ?  [["party_id", 2]]
---
<div class="task-list">
  <% @party.tasks.each do |task| %>