app/controllers/index_controller.rb

  def index
  	@parties = Party.where(user_id: current_user.id)
---
SELECT "parties".* FROM "parties" WHERE "parties"."user_id" = ?  [["user_id", 1]]