app/controllers/parties_controller.rb

INSERT INTO "parties" ("time", "place", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["time", "2000-01-01 13:27:00"], ["place", "3134 North Clark Street, Chicago, IL, USA"], ["user_id", 1], ["created_at", "2018-05-23 18:27:39.784343"], ["updated_at", "2018-05-23 18:27:39.784343"]]
---
  def create
    hash = make_party_hash(params)
    @party = Party.create(hash)

DELETE FROM "parties" WHERE "parties"."id" = ?  [["id", 1]]
---
  def delete
    @party = Party.destroy(params[:id])