app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("description", "guest_name", "party_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["description", "fasd"], ["guest_name", "sdaf"], ["party_id", 2], ["created_at", "2018-05-23 20:56:55.714877"], ["updated_at", "2018-05-23 20:56:55.714877"]]
---
  def create
    hash = make_task_hash(params[:task])
    @task = Task.create(hash)

DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]
---
  def delete
  	@task = Task.destroy(params[:id])